<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Atelier;
use Illuminate\Support\Facades\Schema;

class AtelierSeeder extends Seeder
{
    public function run(): void
    {
        Schema::disableForeignKeyConstraints();

        Atelier::truncate();

        Schema::enableForeignKeyConstraints();

        $ateliers = [
            [
                'name' => 'Ательє "Елегант"', 'image' => '/images/atelier1.jpeg', 'city' => 'Київ', 'address' => 'вул. Хрещатик, 10', 'email' => 'elegant@atelier.ua', 'phone' => '+380931112233',
                'tags' => ['місто' => ['Київ'], 'вид роботи' => ['Виготовлення'], 'термін виготовлення' => ['Звичайний'], 'категорія виробу' => ['Одяг'], 'для кого' => ['Жінка'], 'асортимент' => ['Весільна сукня', 'Вечірня сукня']],
            ],
            [
                'name' => 'Ательє "Шик & Стиль"', 'image' => '/images/atelier2.jpg', 'city' => 'Львів', 'address' => 'просп. Свободи, 25', 'email' => 'chicstyle@atelier.ua', 'phone' => '+380971234567',
                'tags' => ['місто' => ['Львів'], 'вид роботи' => ['Ремонт', 'Виготовлення'], 'термін виготовлення' => ['Терміновий'], 'категорія виробу' => ['Взуття'], 'для кого' => ['Чоловік']],
            ],
            [
                'name' => 'Ательє "Модні аксесуари"', 'image' => '/images/atelier3.jpeg', 'city' => 'Одеса', 'address' => 'вул. Дерибасівська, 15', 'email' => 'accessories@atelier.ua', 'phone' => '+380661234567',
                'tags' => ['місто' => ['Одеса'], 'вид роботи' => ['Виготовлення'], 'термін виготовлення' => ['Звичайний', 'Терміновий'], 'категорія виробу' => ['Аксесуари'], 'що потрібно виготовити' => ['Сумки', 'Головні убори']],
            ],
            [
                'name' => 'Ательє "СпортСтиль"', 'image' => '/images/atelier4.jpg', 'city' => 'Київ', 'address' => 'вул. Січових Стрільців, 12', 'email' => 'sportstyle@atelier.ua', 'phone' => '+380501112233',
                'tags' => ['місто' => ['Київ'], 'вид роботи' => ['Виготовлення', 'Ремонт'], 'термін виготовлення' => ['Терміновий'], 'категорія виробу' => ['Одяг'], 'для кого' => ['Чоловік', 'Жінка'], 'асортимент' => ['Спортивний костюм', 'Трикотажний виріб']],
            ],
            [
                'name' => 'Ательє "Класика"', 'image' => '/images/atelier5.jpg', 'city' => 'Хмельницький', 'address' => 'вул. Листопадового Чину, 7', 'email' => 'classica@atelier.ua', 'phone' => '+380987654321',
                'tags' => ['місто' => ['Хмельницький'], 'вид роботи' => ['Виготовлення'], 'термін виготовлення' => ['Звичайний'], 'категорія виробу' => ['Одяг'], 'для кого' => ['Чоловік'], 'асортимент' => ['Класичний костюм', 'Верхній одяг']],
            ],
            [
                'name' => 'Ательє "Дитячий Світ"', 'image' => '/images/atelier6.jpg', 'city' => 'Миколаїв', 'address' => 'вул. Катерининська, 22', 'email' => 'kidsworld@atelier.ua', 'phone' => '+380667778899',
                'tags' => ['місто' => ['Миколаїв'], 'вид роботи' => ['Виготовлення'], 'термін виготовлення' => ['Терміновий', 'Звичайний'], 'категорія виробу' => ['Одяг'], 'для кого' => ['Дитина'], 'асортимент' => ['Повсякденна сукня', 'Повсякденний костюм']],
            ],
            [
                'name' => 'Ательє "DressCode"', 'image' => '/images/atelier7.jpeg', 'city' => 'Хмельницький', 'address' => 'вул. Зарічанська, 22', 'email' => 'dresscode@atelier.ua', 'phone' => '+380667778899',
                'tags' => ['місто' => ['Хмельницький'], 'вид роботи' => ['Виготовлення'], 'термін виготовлення' => ['Терміновий', 'Звичайний'], 'категорія виробу' => ['Одяг'], 'для кого' => ['Чоловік'], 'асортимент' => ['Класичний костюм', 'Верхній одяг']],
            ],
            [
                'name' => 'Ательє "Шовк та Фенхель"', 'image' => '/images/atelier8.jpg', 'city' => 'Хмельницький', 'address' => 'вул. Петлюри, 7', 'email' => 'silkfenhel@atelier.ua', 'phone' => '+380987654321',
                'tags' => ['місто' => ['Хмельницький'], 'вид роботи' => ['Виготовлення'], 'термін виготовлення' => ['Звичайний'], 'категорія виробу' => ['Одяг'], 'для кого' => ['Чоловік'], 'асортимент' => ['Класичний костюм', 'Верхній одяг']],
            ],
        ];

        foreach ($ateliers as $atelierData) {
            Atelier::create($atelierData);
        }
    }
}
