<?php
namespace App\Http\Controllers;

use Illuminate\Support\Facades\Log;
use Illuminate\Http\Request;


class PageController extends Controller
{
    public function index()   {
        Log::error("HERE...");
        return view('page.index');
    }
    public function about()   { return view('page.about'); }
    /////
    public function atelier(Request $request)
        {

            $ateliers = [
            [
                    'name' => 'Ательє "Елегант"',
                    'image' => '/images/atelier1.jpeg',
                    'city' => 'Київ',
                    'address' => 'вул. Хрещатик, 10',
                    'email' => 'elegant@atelier.ua',
                    'phone' => '+380931112233',
                    'tags' => [
                        'місто' => ['Київ'],
                        'вид роботи' => ['Виготовлення'],
                        'термін виготовлення' => ['Звичайний'],
                        'категорія виробу' => ['Одяг'],
                        'для кого' => ['Жінка'],
                        'асортимент' => ['Весільна сукня', 'Вечірня сукня'],
                    ],
                ],
                [
                    'name' => 'Ательє "Шик & Стиль"',
                    'image' => '/images/atelier2.jpg',
                    'city' => 'Львів',
                    'address' => 'просп. Свободи, 25',
                    'email' => 'chicstyle@atelier.ua',
                    'phone' => '+380971234567',
                    'tags' => [
                        'місто' => ['Львів'],
                        'вид роботи' => ['Ремонт', 'Виготовлення'],
                        'термін виготовлення' => ['Терміновий'],
                        'категорія виробу' => ['Взуття'],
                        'для кого' => ['Чоловік'],
                    ],
                ],
                [
                'name' => 'Ательє "Модні аксесуари"',
                'image' => '/images/atelier3.jpeg',
                'city' => 'Одеса',
                'address' => 'вул. Дерибасівська, 15',
                'email' => 'accessories@atelier.ua',
                'phone' => '+380661234567',
                'tags' => [
                    'місто' => ['Одеса'],
                    'вид роботи' => ['Виготовлення'],
                    'термін виготовлення' => ['Звичайний', 'Терміновий'],
                    'категорія виробу' => ['Аксесуари'],
                    'що потрібно виготовити' => ['Сумки', 'Головні убори'],
                ],
            ],
            [
                'name' => 'Ательє "СпортСтиль"',
                'image' => '/images/atelier4.jpg',
                'city' => 'Київ',
                'address' => 'вул. Січових Стрільців, 12',
                'email' => 'sportstyle@atelier.ua',
                'phone' => '+380501112233',
                'tags' => [
                    'місто' => ['Київ'],
                    'вид роботи' => ['Виготовлення', 'Ремонт'],
                    'термін виготовлення' => ['Терміновий'],
                    'категорія виробу' => ['Одяг'],
                    'для кого' => ['Чоловік', 'Жінка'],
                    'асортимент' => ['Спортивний костюм', 'Трикотажний виріб'],
                ],
            ],
            [
                'name' => 'Ательє "Класика"',
                'image' => '/images/atelier5.jpg',
                'city' => 'Хмельницький',
                'address' => 'вул. Листопадового Чину, 7',
                'email' => 'classica@atelier.ua',
                'phone' => '+380987654321',
                'tags' => [
                    'місто' => ['Хмельницький'],
                    'вид роботи' => ['Виготовлення'],
                    'термін виготовлення' => ['Звичайний'],
                    'категорія виробу' => ['Одяг'],
                    'для кого' => ['Чоловік'],
                    'асортимент' => ['Класичний костюм', 'Верхній одяг'],
                ],
            ],
            [
                'name' => 'Ательє "Дитячий Світ"',
                'image' => '/images/atelier6.jpg',
                'city' => 'Миколаїв',
                'address' => 'вул. Катерининська, 22',
                'email' => 'kidsworld@atelier.ua',
                'phone' => '+380667778899',
                'tags' => [
                    'місто' => ['Миколаїв'],
                    'вид роботи' => ['Виготовлення'],
                    'термін виготовлення' => ['Терміновий', 'Звичайний'],
                    'категорія виробу' => ['Одяг'],
                    'для кого' => ['Дитина'],
                    'асортимент' => ['Повсякденна сукня', 'Повсякденний костюм'],
                ],
            ],
                    [
                'name' => 'Ательє "DressCode"',
                'image' => '/images/atelier7.jpeg',
                'city' => 'Хмельницький',
                'address' => 'вул. Зарічанська, 22',
                'email' => 'kidsworld@atelier.ua',
                'phone' => '+380667778899',
                'tags' => [
                    'місто' => ['Хмельницький'],
                    'вид роботи' => ['Виготовлення'],
                    'термін виготовлення' => ['Терміновий', 'Звичайний'],
                    'категорія виробу' => ['Одяг'],
                    'для кого' => ['Чоловік'],
                    'асортимент' => ['Класичний костюм', 'Верхній одяг'],
                ],
            ],
                    [
                'name' => 'Ательє "Шовк та Фенхель"',
                'image' => '/images/atelier8.jpg',
                'city' => 'Хмельницький',
                'address' => 'вул. Петлюри, 7',
                'email' => 'classica@atelier.ua',
                'phone' => '+380987654321',
                'tags' => [
                    'місто' => ['Хмельницький'],
                    'вид роботи' => ['Виготовлення'],
                    'термін виготовлення' => ['Звичайний'],
                    'категорія виробу' => ['Одяг'],
                    'для кого' => ['Чоловік'],
                    'асортимент' => ['Класичний костюм', 'Верхній одяг'],
                ],
            ],
        ];

        $search = $request->query('search'); // отримуємо текст пошуку

        if ($search) {
            $searchLower = mb_strtolower($search);

            $ateliers = array_filter($ateliers, function($atelier) use ($searchLower) {
                // перевіряємо назву ательє
                if (mb_stripos($atelier['name'], $searchLower) !== false) {
                    return true;
                }

                // перевіряємо всі теги
                foreach ($atelier['tags'] as $tagKey => $tagValues) {
                    foreach ($tagValues as $value) {
                        if (mb_stripos($value, $searchLower) !== false) {
                            return true;
                        }
                    }
                }

                return false;
            });
        }

        return view('page.atelier', compact('ateliers', 'search'));
    }
    public function faq()     { return view('page.faq'); }
public function profile()
    {
        return view('page.profile');
    }
    public function match()
    {
        return view('page.match');
    }
    public function catalog()
    {
        $materials = [
        [
            'name' => 'Трикотаж Бавовна',
            'image' => '/images/Трикотаж бававна.jpg',
            'colors' => 'Білий, Рожевий, Синій +1',
            'delivery' => '2-3 дні',
            'price' => '320 грн/м',
            'in_stock' => true,
        ],
        [
            'name' => 'Вовна Костюмна',
            'image' => '/images/Вовна костюмна.jpg',
            'colors' => 'Синій, Сірий, Зелений +1',
            'delivery' => '5-7 днів',
            'price' => '500 грн/м',
            'in_stock' => true,
        ],
        [
            'name' => 'Шовк Принт',
            'image' => '/images/Шовк принт.jpg',
            'colors' => 'Білий, Кремовий, Сірий +2',
            'delivery' => '3-5 днів',
            'price' => '420 грн/м',
            'in_stock' => true,
        ],
        [
            'name' => 'Підкладка Віскоза',
            'image' => '/images/Підкладка віскоза.jpg',
            'colors' => 'Білий, Кремовий, Бежевий +1',
            'delivery' => '1-2 дні',
            'price' => '200 грн/м',
            'in_stock' => true,
        ],
        [
            'name' => 'Льон Класичний',
            'image' => '/images/93bbdc587cbc2ee06b56b3ce27ef4dcc.jpg',
            'colors' => 'Бежевий, Коричневий, Темно-синій +2',
            'delivery' => '4-6 днів',
            'price' => '300 грн/м',
            'in_stock' => false,
        ],
        [
            'name' => 'Шкіра Еко',
            'image' => '/images/Шкіра еко.jpg',
            'colors' => 'Бежевий, Коричневий, Темно-червоний +1',
            'delivery' => '3-5 днів',
            'price' => '550 грн/м',
            'in_stock' => true,
        ],
    ];

        return view('page.catalog', compact('materials'));
        //return view('page.catalog');
    }

    public function select()
    {
        return view('page.select');
    }
 //////////////

    public function result(Request $request)
    {
        $ateliers = $this->getAteliers();

        // Отримуємо тільки ті поля, що мають значення
        $criteria = array_filter($request->only([
            'місто', 'вид роботи', 'термін виготовлення', 'категорія виробу', 'для кого', 'асортимент'
        ]));

        $filtered = array_filter($ateliers, function ($atelier) use ($criteria) {
            foreach ($criteria as $key => $value) {
                // Якщо ательє не має цього тегу або значення не входить в масив тегів, пропускаємо
                if (!isset($atelier['tags'][$key])) {
                    return false;
                }
                // частковий збіг: перевіряємо, чи є хоча б один збіг
                if (!in_array($value, $atelier['tags'][$key])) {
                    return false;
                }
            }
            return true;
        });

        return view('page.result', ['ateliers' => $filtered]);
    }

    // Додамо функцію getAteliers для підбору
    private function getAteliers()
    {
        return [
            [
                    'name' => 'Ательє "Елегант"',
                    'image' => '/images/atelier1.jpeg',
                    'city' => 'Київ',
                    'address' => 'вул. Хрещатик, 10',
                    'email' => 'elegant@atelier.ua',
                    'phone' => '+380931112233',
                    'tags' => [
                        'місто' => ['Київ'],
                        'вид роботи' => ['Виготовлення'],
                        'термін виготовлення' => ['Звичайний'],
                        'категорія виробу' => ['Одяг'],
                        'для кого' => ['Жінка'],
                        'асортимент' => ['Весільна сукня', 'Вечірня сукня'],
                    ],
                ],
                [
                    'name' => 'Ательє "Шик & Стиль"',
                    'image' => '/images/atelier2.jpg',
                    'city' => 'Львів',
                    'address' => 'просп. Свободи, 25',
                    'email' => 'chicstyle@atelier.ua',
                    'phone' => '+380971234567',
                    'tags' => [
                        'місто' => ['Львів'],
                        'вид роботи' => ['Ремонт', 'Виготовлення'],
                        'термін виготовлення' => ['Терміновий'],
                        'категорія виробу' => ['Взуття'],
                        'для кого' => ['Чоловік'],
                    ],
                ],
                [
                'name' => 'Ательє "Модні аксесуари"',
                'image' => '/images/atelier3.jpeg',
                'city' => 'Одеса',
                'address' => 'вул. Дерибасівська, 15',
                'email' => 'accessories@atelier.ua',
                'phone' => '+380661234567',
                'tags' => [
                    'місто' => ['Одеса'],
                    'вид роботи' => ['Виготовлення'],
                    'термін виготовлення' => ['Звичайний', 'Терміновий'],
                    'категорія виробу' => ['Аксесуари'],
                    'що потрібно виготовити' => ['Сумки', 'Головні убори'],
                ],
            ],
            [
                'name' => 'Ательє "СпортСтиль"',
                'image' => '/images/atelier4.jpg',
                'city' => 'Київ',
                'address' => 'вул. Січових Стрільців, 12',
                'email' => 'sportstyle@atelier.ua',
                'phone' => '+380501112233',
                'tags' => [
                    'місто' => ['Київ'],
                    'вид роботи' => ['Виготовлення', 'Ремонт'],
                    'термін виготовлення' => ['Терміновий'],
                    'категорія виробу' => ['Одяг'],
                    'для кого' => ['Чоловік', 'Жінка'],
                    'асортимент' => ['Спортивний костюм', 'Трикотажний виріб'],
                ],
            ],
            [
                'name' => 'Ательє "Класика"',
                'image' => '/images/atelier5.jpg',
                'city' => 'Хмельницький',
                'address' => 'вул. Листопадового Чину, 7',
                'email' => 'classica@atelier.ua',
                'phone' => '+380987654321',
                'tags' => [
                    'місто' => ['Хмельницький'],
                    'вид роботи' => ['Виготовлення'],
                    'термін виготовлення' => ['Звичайний'],
                    'категорія виробу' => ['Одяг'],
                    'для кого' => ['Чоловік'],
                    'асортимент' => ['Класичний костюм', 'Верхній одяг'],
                ],
            ],
            [
                'name' => 'Ательє "Дитячий Світ"',
                'image' => '/images/atelier6.jpg',
                'city' => 'Миколаїв',
                'address' => 'вул. Катерининська, 22',
                'email' => 'kidsworld@atelier.ua',
                'phone' => '+380667778899',
                'tags' => [
                    'місто' => ['Миколаїв'],
                    'вид роботи' => ['Виготовлення'],
                    'термін виготовлення' => ['Терміновий', 'Звичайний'],
                    'категорія виробу' => ['Одяг'],
                    'для кого' => ['Дитина'],
                    'асортимент' => ['Повсякденна сукня', 'Повсякденний костюм'],
                ],
            ],
                    [
                'name' => 'Ательє "DressCode"',
                'image' => '/images/atelier7.jpeg',
                'city' => 'Хмельницький',
                'address' => 'вул. Зарічанська, 22',
                'email' => 'kidsworld@atelier.ua',
                'phone' => '+380667778899',
                'tags' => [
                    'місто' => ['Хмельницький'],
                    'вид роботи' => ['Виготовлення'],
                    'термін виготовлення' => ['Терміновий', 'Звичайний'],
                    'категорія виробу' => ['Одяг'],
                    'для кого' => ['Чоловік'],
                    'асортимент' => ['Класичний костюм', 'Верхній одяг'],
                ],
            ],
                    [
                'name' => 'Ательє "Шовк та Фенхель"',
                'image' => '/images/atelier8.jpg',
                'city' => 'Хмельницький',
                'address' => 'вул. Петлюри, 7',
                'email' => 'classica@atelier.ua',
                'phone' => '+380987654321',
                'tags' => [
                    'місто' => ['Хмельницький'],
                    'вид роботи' => ['Виготовлення'],
                    'термін виготовлення' => ['Звичайний'],
                    'категорія виробу' => ['Одяг'],
                    'для кого' => ['Чоловік'],
                    'асортимент' => ['Класичний костюм', 'Верхній одяг'],
                ],
            ],
            // Інші ательє...
        ];
    }


}
